### Problem_1: List any five functions of the pandas library with execution.

In [2]:
import pandas as pd
# Create a sample data frame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 22, 28],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(data)
#1.
df.head(2)

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [45]:
#2.
df.tail(1)

    Name  Age     City
3  David   28  Houston

In [46]:
#3.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [47]:
#4.
df.describe()

         Age
count   4.00
mean   26.25
std     3.50
min    22.00
25%    24.25
50%    26.50
75%    28.50
max    30.00

In [48]:
#5.
df.sort_values(by='Age', ascending=False)

      Name  Age         City
1      Bob   30  Los Angeles
3    David   28      Houston
0    Alice   25     New York
2  Charlie   22      Chicago

### Problem_2: Given a pandas DataFrame df with columns 'A','B' and 'C', write a python fucntion to re-index the DataFrame witha new index that starts from 1 and increments by 2 for each row.

In [4]:
# function to re-index the DataFrame with a new index that starts from 1 and increment by 2 for each row


# Sample DataFrame
data = {'A': [1, 2, 3,4,5], 'B': [4, 5, 6,3,6], 'C': [7, 8, 9,2,8]}
df = pd.DataFrame(data)

df_1=df[1::2]
df_1

   A  B  C
1  2  5  8
3  4  3  2

In [33]:
# Executing the re-index function

### Problem_3: You have a pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
### For example, if the 'Values' column of df contains the values [10,20,30,40,50], your function should calculate and print the sum of the first three values, which is 60.

In [58]:
def Calculate_sum(df):
    # Check if there atleast 3 values in the 'Values' column
    if len(df)<3:
        print("Error: The 'Value' column has less than 3 elements")
        return 
    # Calculate and print the sum of first three element of 'Values' column
    sum_of_three= df['Values'].iloc[:3].sum()
    print(f"The sum of first three value of the 'Values' column is: {sum_of_three}")
# Sample Data
data={'Values':[10,20,30,40,50,60]}
df=pd.DataFrame(data)

Calculate_sum(df.copy())

The sum of first three value of the 'Values' column is: 60

### Problem_4: Given a pandas DataFrame df with a column 'Text', write a python function to create a new column 'word_count' that contains the number of words in each row of the 'Text' column.

In [63]:
data={'Text':['Hi i am anmol rana','i am from distt. una','My hobbies are to playing games, cricket and reading books']}
df=pd.DataFrame(data)
df['word_count']=df['Text'].apply(lambda x:len(x.split()))
df

                                                Text  word_count
0                                 Hi i am anmol rana           5
1                               i am from distt. una           5
2  My hobbies are to playing games, cricket and r...          10

### Problem_5: How are DataFrame.size() and DataFrame.shape() different?

1. DataFrame.size()

  - Returns the total number of elements in the DataFrame.
  - This is calculated by multiplying the number of rows by the number of columns.
  - It's essentially a single integer value representing the total number of data points in the DataFrame.
2. DataFrame.shape

  - Returns a tuple of two integers representing the dimensions of the DataFrame:
  - The first element is the number of rows (length of the index).
  - The second element is the number of columns.

### Problem_6: Which function of pandas do we use to read an excel file?

  - 'read_xls' function of pandas is used to read the excel file

### Problem_7: You have a pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a python function that create a new column 'Username' in df that contains only the username part of each email address.
### The username is part of the email address that appears before the '@' symbol.For example,if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [69]:
data={'Email':['anmolrana@gmail.com','mafia@gmail.com','sulekhathakur@gmail.com']}
df=pd.DataFrame(data)
df['Username']=df['Email'].str.split('@').str.get(0)
df

                     Email       Username
0      anmolrana@gmail.com      anmolrana
1          mafia@gmail.com          mafia
2  sulekhathakur@gmail.com  sulekhathakur

### Problem_8: You have a pandas DataFrame df with columns 'A','B' and 'C'. Write a python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contians only the selected rows.

In [74]:
def filter_by_conditions(df):
    
  # Filter rows where A > 5 and B < 10
    filtered_df = df[(df['A'] > 5) & (df['B'] < 10)]

    return filtered_df

# Sample DataFrame
data = {'A': [3,8,6,2,9],
        'B': [5,2,9,3,1],
        'C': [1,7,4,5,2]}
df = pd.DataFrame(data)

# Apply the filter function
filtered_df = filter_by_conditions(df.copy())  # Apply to a copy to avoid modifying original
print(filtered_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Problem_9: Given a pandas DataFrame df with a column 'Values', write a python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [79]:
data={'Values':[10,22,32,54,12,44]}
df=pd.DataFrame(data)

statistics={
    'Mean':df['Values'].mean(),
    'Median': df['Values'].median(),
    'Standard deviation':df['Values'].std()
}
statistics

{'Mean': 29.0, 'Median': 27.0, 'Standard deviation': 17.652195330892983}

### Problem_10: Given a pandas DataFrame df with a column 'Sales' and a column 'Date', write a python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [11]:
# Sample DataFrame (assuming 'Date' is datetime and 'Sales' is numeric)
data = {'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05', '2024-01-06', '2024-01-07'],
        'Sales': [10, 20, 30, 40, 50, 60, 70]}
df = pd.DataFrame(data)

 # Add a new 'MovingAverage' column with NaN values
df['MovingAverage']=df['Sales'].rolling(window=7).mean()

# Fill NaN values in the first 'window_size - 1' rows with the first valid value
df['MovingAverage'].iloc[:7- 1] = df['Sales'].iloc[:7- 1].fillna(method='ffill')
df

/tmp/ipykernel_77/2412518800.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['MovingAverage'].iloc[:7- 1] = df['Sales'].iloc[:7- 1].fillna(method='ffill')

         Date  Sales  MovingAverage
0  2024-01-01     10           10.0
1  2024-01-02     20           20.0
2  2024-01-03     30           30.0
3  2024-01-04     40           40.0
4  2024-01-05     50           50.0
5  2024-01-06     60           60.0
6  2024-01-07     70           40.0

### Problem_11: You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday)corresponding to each date in the 'Date' column.

In [85]:
data={'Date':pd.to_datetime(['2024-03-05','2024-03-06','2024-03-07'])}
df=pd.DataFrame(data)
df['Weekday']=df['Date'].dt.day_name()
df

        Date    Weekday
0 2024-03-05    Tuesday
1 2024-03-06  Wednesday
2 2024-03-07   Thursday

### Problem_12: Given a pandas DataFrame df with a column 'Date' that contains timestamps, write a python function to select all rows where the date is between '2024-01-01' and '2024-01-31'.

In [3]:
data=pd.date_range(start='2024-01-01',end='2024-01-31')
data

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10', '2024-01-11', '2024-01-12',
               '2024-01-13', '2024-01-14', '2024-01-15', '2024-01-16',
               '2024-01-17', '2024-01-18', '2024-01-19', '2024-01-20',
               '2024-01-21', '2024-01-22', '2024-01-23', '2024-01-24',
               '2024-01-25', '2024-01-26', '2024-01-27', '2024-01-28',
               '2024-01-29', '2024-01-30', '2024-01-31'],
              dtype='datetime64[ns]', freq='D')

### Problem_13: To use the basic function of pandas, what is the first and foremost necessary library that needs to be imported?

  - We have to import pandas library to use the basic functions of pandas.